Revit 2027 API
MEPNetworkIterator.GetAnalyticalModelData Method
 Gets the analytical model data at the current iteration step.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPAnalyticalModelData GetAnalyticalModelData()
Public Function GetAnalyticalModelData As MEPAnalyticalModelData
public:
MEPAnalyticalModelData^ GetAnalyticalModelData()
member GetAnalyticalModelData : unit -> MEPAnalyticalModelData
Return Value
MEPAnalyticalModelData
 The retrieved model data.
See Also
Reference
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace